In [48]:
import numpy as np
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import RandomForestRegressor
from sklearn.ensemble import AdaBoostClassifier
from sklearn.ensemble import GradientBoostingClassifier
from sklearn.svm import SVC
from sklearn.svm import SVR
from sklearn.naive_bayes import GaussianNB
from matplotlib import pyplot as plt
from sklearn.model_selection import train_test_split
import seaborn as sns
from sklearn.preprocessing import MinMaxScaler
from xgboost import XGBClassifier
from sklearn.metrics import accuracy_score

from sklearn.metrics import confusion_matrix 
from sklearn.metrics import accuracy_score 
from sklearn.metrics import classification_report
from numpy import loadtxt
from keras.models import Sequential
from keras.layers import Dense
from keras.models import model_from_json
from keras.models import model_from_yaml
from sklearn import model_selection
from sklearn.linear_model import LinearRegression
from datetime import date

import pickle
import os

In [2]:
df=pd.read_csv('fbP_forecasted_data.csv')
df.head()

,Unnamed: 0,ds,location,Area_Marla,bedrooms,bathrooms,yhat
0,0,2020-11-17,"D-12, Islamabad",4.4,4,4,2.651258e+07
1,1,2021-12-17,"D-12, Islamabad",4.4,4,4,2.702375e+07
2,2,2022-01-17,"D-12, Islamabad",4.4,4,4,3.005134e+07
3,3,2022-01-20,"D-12, Islamabad",4.4,4,4,3.126493e+07
4,4,2022-02-03,"D-12, Islamabad",4.4,4,4,3.148655e+07

In [3]:
dfX=df[['ds','location','Area_Marla','bedrooms','bathrooms','yhat']]
dfX=dfX.rename(columns={"yhat":"price"})

In [49]:
# dfX=dfX.head(500)

In [56]:
today = date.today()
today.year
year=str(today.year)
month=today.month
day=today.day
if(month<10):
    month="0"+str(month)
else:
    month=str(month)

if(day<10):
    day="0"+str(day)
else:
    day=str(day)


dat=year+"-"+month+"-"+day
dat

'2022-03-04'

In [5]:
dfX=dfX[dfX['price']>0]

In [6]:
dfX.head()

           ds         location  Area_Marla  bedrooms  bathrooms         price
0  2020-11-17  D-12, Islamabad         4.4         4          4  2.651258e+07
1  2021-12-17  D-12, Islamabad         4.4         4          4  2.702375e+07
2  2022-01-17  D-12, Islamabad         4.4         4          4  3.005134e+07
3  2022-01-20  D-12, Islamabad         4.4         4          4  3.126493e+07
4  2022-02-03  D-12, Islamabad         4.4         4          4  3.148655e+07

In [13]:
dfLoc=dfX['location'].unique()
dfLoc

array(['D-12, Islamabad', 'D-12/1, D-12', 'D-12/4, D-12'], dtype=object)

In [17]:
dfM=dfX[dfX['location']==dfLoc[0]]
dfM

,ds,location,Area_Marla,bedrooms,bathrooms,price
0,2020-11-17,"D-12, Islamabad",4.4,4,4,2.651258e+07
1,2021-12-17,"D-12, Islamabad",4.4,4,4,2.702375e+07
2,2022-01-17,"D-12, Islamabad",4.4,4,4,3.005134e+07
3,2022-01-20,"D-12, Islamabad",4.4,4,4,3.126493e+07
4,2022-02-03,"D-12, Islamabad",4.4,4,4,3.148655e+07
...,...,...,...,...,...,...
2622,2023-02-13,"D-12, Islamabad",20.0,9,9,2.714622e+07
2623,2023-02-14,"D-12, Islamabad",20.0,9,9,6.132937e+07
2624,2023-02-15,"D-12, Islamabad",20.0,9,9,2.673205e+07
2625,2023-02-16,"D-12, Islamabad",20.0,9,9,5.472455e+07
2626,2023-02-17,"D-12, Islamabad",20.0,9,9,4.933245e+07

In [34]:
marlalst=list(dfM.Area_Marla.unique())
marlalst

[4.4, 5.0, 4.0, 14.0, 8.0, 10.0, 20.0]

In [36]:
baths=dfM[dfM['Area_Marla']==marlalst[2]]['bathrooms'].unique()

In [37]:
beds=dfM[dfM['Area_Marla']==marlalst[2]]['bedrooms'].unique()

In [59]:
dfM=dfM[dfM['Area_Marla']==marlalst[2]]
dfM

,ds,location,Area_Marla,bedrooms,bathrooms,price
748,2021-06-17,"D-12, Islamabad",4.0,4,5,3.301886e+07
749,2021-09-17,"D-12, Islamabad",4.0,4,5,2.732734e+07
750,2021-11-17,"D-12, Islamabad",4.0,4,5,3.160397e+07
751,2021-12-17,"D-12, Islamabad",4.0,4,5,2.711838e+07
752,2022-01-17,"D-12, Islamabad",4.0,4,5,2.761879e+07
...,...,...,...,...,...,...
1124,2023-02-13,"D-12, Islamabad",4.0,4,5,2.671865e+07
1125,2023-02-14,"D-12, Islamabad",4.0,4,5,2.735054e+07
1126,2023-02-15,"D-12, Islamabad",4.0,4,5,3.055917e+07
1127,2023-02-16,"D-12, Islamabad",4.0,4,5,3.162042e+07
1128,2023-02-17,"D-12, Islamabad",4.0,4,5,2.613787e+07

In [64]:
dfM[dfM['ds']==dat]['price'].iloc[0]

26941564.13880872

In [7]:
dfX.columns

Index(['ds', 'location', 'Area_Marla', 'bedrooms', 'bathrooms', 'price'], dtype='object')

In [8]:
X_cols=[ 'Area_Marla', 'bedrooms', 'bathrooms']
y_cols=['price']

In [11]:
X_train, X_test, y_train, y_test=train_test_split(dfX[X_cols].values, dfX[y_cols].values, test_size=0.25, random_state=7)

In [29]:
model = RandomForestRegressor()
model.fit(X_train,y_train)

<ipython-input-29-1cdd0c8af6ed>:2: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  model.fit(X_train,y_train)

RandomForestRegressor()

In [30]:
y_pred=model.predict(X_test)
# print(accuracy_score(y_test, y_pred)*100)

In [31]:
model.score(X_test,y_test)*100

10.761283913264752

In [ ]:
y_pred

In [66]:
y_test

NameError: name 'y_test' is not defined

In [73]:
def listToString(s): 
    
    # initialize an empty string
    str1 = "" 
    
    # traverse in the string  
    for ele in s: 
        if(str1!=""):
            str1 +="+" +ele  
        else:
            str1 +=ele  
    
    # return string  
    return str1

In [75]:
#Getting all Unique locations
locs=list(dfX.location.unique())
vals=listToString(locs)

In [77]:
vals

'D-12, Islamabad+D-12/1, D-12+D-12/4, D-12'

In [ ]:
print("<select id='loc'>")
print("<option value=''>Select a location</option>")
for lc in locs:
    print(f"<option value='{lc}'>{lc}</option>")
print("</select)")